<?php /* Smarty version Smarty-3.1.18, created on 2019-07-30 20:20:48
         compiled from "./index.tpl" */ ?>
<?php /*%%SmartyHeaderCode:2886906485d4028104b0a19-57560203%%*/if(!defined('SMARTY_DIR')) exit('no direct access allowed');
$_valid = $_smarty_tpl->decodeProperties(array (
  'file_dependency' => 
  array (
    'e8b82e36b14a5b32b9082c90cfde424dcce75e56' => 
    array (
      0 => './index.tpl',
      1 => 1564132981,
      2 => 'file',
    ),
  ),
  'nocache_hash' => '2886906485d4028104b0a19-57560203',
  'function' => 
  array (
  ),
  'variables' => 
  array (
    'template_meta' => 0,
    'template_javascript' => 0,
    'template_header' => 0,
    'template_footer' => 0,
  ),
  'has_nocache_code' => false,
  'version' => 'Smarty-3.1.18',
  'unifunc' => 'content_5d4028104cd564_78646302',
),false); /*/%%SmartyHeaderCode%%*/?>
<?php if ($_valid && !is_callable('content_5d4028104cd564_78646302')) {function content_5d4028104cd564_78646302($_smarty_tpl) {?><!DOCTYPE html>
<html lang="ja">
<head>
<?php echo $_smarty_tpl->getSubTemplate ($_smarty_tpl->tpl_vars['template_meta']->value, $_smarty_tpl->cache_id, $_smarty_tpl->compile_id, 0, null, array(), 0);?>

<link rel="stylesheet" href="/common/css/import.css">
<?php echo $_smarty_tpl->getSubTemplate ($_smarty_tpl->tpl_vars['template_javascript']->value, $_smarty_tpl->cache_id, $_smarty_tpl->compile_id, 0, null, array(), 0);?>

</head>
<body id="top">
<div id="fb-root"></div>
<script async defer crossorigin="anonymous" src="https://connect.facebook.net/ja_JP/sdk.js#xfbml=1&version=v3.3"></script>
<div id="base">
<?php echo $_smarty_tpl->getSubTemplate ($_smarty_tpl->tpl_vars['template_header']->value, $_smarty_tpl->cache_id, $_smarty_tpl->compile_id, 0, null, array(), 0);?>

<main>
<div id="body" class="mineral_balance">
<div id="top_img">
    <p><img src="/common/image/contents/various_treatment/top.jpg" alt="診療・各種治療"></p>
	<p class="moji"><strong>診療・各種治療</strong><br><span>medical treatment</span></p>
</div>
<div id="pankuzu">
<ul class="center mb30">
	<li><a href="/">TOP</a></li>
	<li><a href="/various_treatment/">診療・各種治療</a></li>
	<li>アトピー性皮膚炎</li>
</ul>
</div>
    <section>
        <div class="mt50 center pos_ac ">
            <h2 class="hl_1">アトピー性皮膚炎</h2>
            <p class="fs fw_bold mb50">mineral balance</p>
    		<div class="border">
    			<h2>食事アレルギーと食事制限・栄養・給食</h2>
    		</div>
            <p class="text">
                食物アレルギーの関与する乳児アトピー性、皮膚炎に症状は主に<span class="c_green">湿疹</span>です。<br>
                原因は、<span class="c_green">鶏卵、牛乳、小麦、大豆</span>が多いです。スキンケア指導やステロイド外用薬などの薬物療法<br>を行っても改善しない場合、いったん軽快してもすぐに皮疹が悪化する場合は食物アレルギーを疑います。<br>
                逆に乳児アトピー性皮膚炎と診断されても食物アレルギーの合併がない患児が３割います。<br>
                食物アレルギーの治療は、<span class="c_green">正しい診断に基づいて必要最小限の原因食物の除去</span>です。
            </p>
            <div class="border">
    			<h2>乾燥肌</h2>
    		</div>
            <p class="text">
                小児期になると皮膚に乾燥を訴える患者が多くなる。<br>
                全身の乾燥が見られる疾患は<span class="c_green">アトピー性皮膚炎、乾癬</span>等です。<br>
                限局する疾患は<span class="c_green">舌なめずり皮膚炎、手湿疹、ズック皮膚炎、おむつ皮膚炎</span>等です。<br>
                生活指導では、毎日入浴して肌を清潔にする必要がある。<br>
                ナイロンタオル、タワシ、固いタオルでゴシゴシ洗わないようにする必要がある。<br>
                入浴後には、<span class="c_green">保湿薬</span>を塗布することが大切である。<br>
                冬の湿度が低いときには、白色ワセリンやアズノール軟膏などの軟膏基剤がよい。<br>
                皮膚を刺激しないように優しく塗布する。擦り込まないほうがよい。
            </p>
            <div class="border">
    			<h2>頸部の色素沈着（さざなみ様色素沈着、dirty neck）の治療</h2>
    		</div>
            <p class="text">
                成人期アトピー性皮膚炎に特有の皮疹変化である。<br>
                ３ｗ原因は、入浴時のナイロンタオルによる機械的刺激、衣服による摩擦や太陽光線や汗や、<br>
                ステロイド外用薬の影響などもある。ステロイド外用薬が使えない場合、プロトピック軟膏は<br>
                長期連用ができ、ステロイド薬と同等の抗炎症効果がある。
            </p>
            <div class="border">
    			<h2>外用薬を混合するわけ</h2>
    		</div>
            <p class="text">
                外用薬の効果を十分にひきだすために必要であり、①重ね塗り、②朝と夜に分けて別々の外用薬を用いる、③混合した外用薬を用いるなどの方法の中、患者の効果、評価が一番高いのは混合製剤です。しかし、混合薬を用いる場合は、①混合による製剤の安定性が確保されている、②接触性皮膚炎の発現に注意、③混合目的が達成された場合は、単剤外用にもどします。混合には、多くのメリットがあり、有効性の根拠も確立されているものもあります。外用薬の混合は薬物の期待された効果を得るために十分に適切な方法と考えられます。しかし、効果を確認し、適時外用薬を変更していく必要があります。尋常性乾癬やアトピー性皮膚炎などに、混合薬は、相乗効果が認められ、非常に利点があります。
            </p>
            <div class="border">
    			<h2>スギ花粉による皮膚炎はよくあること</h2>
    		</div>
            <p class="text">
                飛散によるスギ花粉が、皮膚に接触することによる接触皮膚炎です。アトピー性皮膚炎の30%程度が、スギ花粉により増悪します。スギ花粉接触皮膚炎は露出ぶいである顔、頚部、眼囲に蕁麻疹様の浮腫性紅班が初発します。診断に必要な検査は、スギRAST、スギスクラッチ、スギスクラッチ（ストリッピング）パッチテストが、スギ花粉皮膚炎では陽性率が高いです。女性に多いです。第２世代の抗ヒスタミン薬を処方するなど花粉症の治療をしましょう。
            </p>
            <div class="border">
    			<h2>汗はアトピー性皮膚炎を悪化させる</h2>
    		</div>
            <p class="text">
                汗のたまりやすい肘、膝に皮疹が生じます。汗で増悪するADには蕁麻疹を合併している事があります。夏季には、発汗後にシャワーを浴びるのはいいでしょう。治療には経口抗ヒスタミン薬が効きます。
            </p>
            <div class="border">
    			<h2>とびひとはどんなもの</h2>
    		</div>
            <p class="text">
                小児多い、皮膚にばい菌がついて飛ぶ皮膚感染症です。<br>
                伝染性感染症と言います。夏は黄色ブドウ球菌による水泡性の発疹ができ、夏休みにピークをむかえ、秋に減少します。<br>
                冬でも暖房などで、冬場のとびひがあります。０歳から12歳と幅が広いです。治療は、抗菌薬を水泡、びらん面に塗る。亜鉛化単軟膏を均等にのばしたﾘﾝﾄ布でおおう。アトピー性皮膚炎に合併するとかゆみが強く、ステロイド外用薬を塗り、亜鉛化単軟膏を貼り、固定する。かゆみが強い場合は抗アレルギー剤を内服します。抗菌薬が効きにくいMRSAという菌があり、ミノマイシン、ホスオマシン、バンコマイシンなどは効きます。予防には、爪を切り、手洗いをよくしてください。原因の虫刺され、外傷、かぶれなどを放置せず、しっかり治療してください。
            </p>
        </div>
    </section>
    <section class="green mt50 mb50">
        <div class="center pos_ac ">
            <h2 class="hl_1" style="padding-top: 50px;">アトピー性皮膚炎でよくある質問</h2>
            <p class="fs fw_bold mb50">faq</p>
    		<div class="b_dot">
    			<h2><span>1.</span>外用薬の塗る回数と量はどのくらい？</h2>
    		</div>
            <p class="text mb30">
                皮膚に症状がでているところには全部に、痒みがなくなっていても塗るのが一番よく、必要がなくなるときがきたらやめるようにします。一日3回、朝の着替えのとき、昼間（幼稚園など）または学校から帰って汚れを拭いてから、入浴後または寝る前というように回数を決めて行いましょう。 <br>
                量は、塗られたかなという程度の、横からみたらかすかにひかる程度でよいでしょう。たくさん塗らなくてもよいでしょう。
            </p>
            <div class="b_dot">
    			<h2><span>2.</span>アトピー性皮膚炎は難病？</h2>
    		</div>
            <p class="text mb30">
                皮膚科で診察をうける患者は多く、ありふれた病気です。誤った情報によって、正しい治療から遠ざけられたために、症状が悪化した患者さんが増加し、いつのまにか「つくられた難病」となりました。正しい知識と患者さんの努力によって必ず克服できる病気です。
            </p>
            <div class="b_dot">
    			<h2><span>3.</span>アトピー性皮膚炎とはどんな病気？</h2>
    		</div>
                <p class="text mb30">
                    1.アトピー性皮膚炎を起こす遺伝子体質がある。<br>
                    2.湿疹が慢性に経過し治りにくい。<br>
                    3.かゆみを伴い。かくことによって悪化する。<br>
                    4.子供に多く次に２０歳代にまた多く、４０歳前後には少なくなる。<br>
                    5.各年齢によって病気に特徴がある。<br>
                    6.生活環境の中に病気を悪化させる因子がある。<br>
                    7.さまざまな物質に対するIgE抗体が陽性となりやすい。
                </p>
            <div class="b_dot">
    			<h2><span>4.</span>発症原因は？</h2>
    		</div>
            <p class="text">１．素体不足；体に弱っている部分が存在する。遺伝的な要因が大きい。</p>
                <ul class="ul3">
                    <li>・脾；食物を消化し体に有用な津液を作り出します。</li>
                    <li>・腎；消化された栄養を皮膚に行き渡らせる。</li>
                </ul>
            <p class="text">　※「脾」と「腎」の素体不足があると、健全な津液が作りだせず、皮膚を潤すような栄養が行き渡らない。</p>
            <p class="text">２．外患邪気；ｱﾚﾙｷﾞを起こしやすい食べ物やダニ、埃など。人間と環境のバランス異常。</p>
            <p class="text">３. 人間の内部のバランス異常である素体不足、そして人間と環境のバランス異常である六淫にある。</p>
                <ul class="ul3">
                    <li>六淫；「風」　「寒」　「暑」　「湿」　「燥」「火」（熱）の邪気が過剰な状態。</li>
                </ul>
            <h2 class="h2">アトピｰ性皮膚炎が発症しやすくなるのは？</h2>
                <p class="text">心が健やかでなくなるストレス過多の状態。<br>
                ストレスに関わっている内蔵は「肝」であり、ストレスが大きいと機能が低下し、血液を健やかに保つことができず、イライラしたり、すぐにのぼせたり、火照ったりします。体に余分な「熱」が発生し、発汗し体温調節の機能を狂わせる。<br>
                ストレスは「腎」機能も低下させ、老化し肌にシワやシミが増える。<br>
                「脾」の消化機能も悪くなる。<br><br>
                以上のような状態を「情志失調」といい、心の問題があると発症しやすい。<br>
                安心感、信頼感、ストレスのない状態が、肌の状態をよくする(例；温泉、海水浴、断食など）。</p>
            <div class="b_dot">
    			<h2><span>5.</span>養生法は？</h2>
    		</div>
            <ul class="ul2 ul_number">
                <li>特殊な体質であることを充分に認識しましょう。</li>
                <li>紫外線対策を講じましょう。</li>
                <li>動物の食材を充分に加熱してから食べましょう。</li>
                <li>冷たいものをさけましょう。</li>
                <li>化学繊維、ウール製品の下着を避けましょう。</li>
                <li>酵素の入った洗剤は避けましょう。</li>
                <li>ストレスを避けましょう。</li>
                <li>環境を整備、改善しましょう。</li>
                <li>清潔にしましょう。</li>
                <li>便通に気をつけましょう。</li>
                <li>偏食は避けましょう。</li>
                <li>感染の予防に努めましょう。</li>
                <li>スキンケアを心がけましょう。</li>
                <li>皮膚を掻かないようにしましょう。</li>
                <li>皮膚が改善されても治療を続けましょう。</li>
            </ul>
            <div class="b_dot">
    			<h2><span>6.</span>スキンケア方法は？</h2>
    		</div>
            <p class="text">スキンケア用品を選ぶ時；敏感肌用のものを選ぶ。<br>
            敏感肌のメイク用品も、アイラインを引く際の摩擦を軽減するように芯が少し軟らかくできていたり接触性皮膚炎を起こしにくいように金属成分がコーティングされていたり工夫されている。<br><br>スキンケア用品を選ぶ時；敏感肌用のものを選ぶ。
            敏感肌のメイク用品も、アイラインを引く際の摩擦を軽減するように芯が少し軟らかくできていたり接触性皮膚炎を起こしにくいように金属成分がコーティングされていたり工夫されている。</p>
            <h2 class="h2">スキンケア</h2>
            <ul class="ul2 ul_number">
                <li class="mb30">洗顔；洗いすぎない<br>
                    洗顔料をよく泡立てる。その泡をつぶさないように洗顔する。<br>
                    皮膚にシワがよらないように、指をそろえて大きな円を描くように動かす。<br>
                    乾燥が強いときには洗顔料を用いずにやや冷ための微温湯で洗う場合もある。
                </li>
                <li class="mb30">洗う；洗い残しをしない<br>
                    10回を目安に手を大きく動かす。<br>
                    生え際やこめかみに洗い残しがないようにする。<br>
                    水気を拭く際にはこすっていないかを必ず確認し、タオルで軽く押さえるように指導する。
                </li>
                <li class="mb30">保湿；十分な保湿をする。<br>
                    化粧水は手掌全体で皮膚に密着させるように、顔の中心から耳前部までなじませる。<br>
                    鼻唇溝などくぼんだところは指を使ってなじませる。乾燥が気になる部位には重ねてつける。<br>
                    コットンを用いてパッティングするのは刺激になりうるので勧められない。<br>
                    クリームや化粧下地についても摩擦を最小限にするため、頬の数箇所に分けて置き、<br>
                    指の第２関節までの広い面を用いてなじませていく。<br>
                    眼周囲は特に皮膚が薄いので、第４指腹を用いてやさしく外用する。
                </li>
            </ul>
            <h2 class="h2" style="color:#6D6D6D;">ベースメイク</h2>
                <p class="text">
                    適切な量を適切なタッチで、メイク道具は清潔に。<br>
                    ファンデーションは皮膚が動かない程度の軽いタッチで、滑らせるように塗布する。<br>
                    ファンデーションの量は顔の中心にしっかり、外側に向かって薄くグランデーションをつける。<br>
                    頬の高い位置の丸い部分につやがないと全体的に乾燥して見えるため、この部分は事前に十分保湿しておくとよい。<br>
                    スポンジやパフは常に清潔に保つ。
                </p>
            <h2 class="h2" style="color:#6D6D6D;">ポイントメイク</h2>
            <ul class="ul2 ul_number">
                <li>眉毛；無駄な毛はカットし、疎毛な部分はアイブロウで補う。<br>
                眉尻を明瞭にすると顔全体に立体感が出る。
                </li>
                <li>アイメイク；アイシャドーはなるべく明るい色を選択する。<br>
                ブラシもしくは指で、まぶたに置くようにつける。<br>
                下眼瞼の目頭1/3にも明るい色のアイシャドーをつけると若々しい印象になる。<br>
                アイラインを引くと凛とした目元になる。<br>
                ビューラーで睫毛を根元から立ち上げ、<br>
                マスカラは睫毛が放射状に広がるようにつけると目元の印象がはっきりする。</li>
                <li>頬；頬の高い位置にチークを入れると血色がよく、健康的に見える。<br>
                    下顎から頚部の境界に肌より一段濃い茶系のパウダーをつけると、<br>
                    頚部の色素沈着との境界を自然に見せることができる。
                    </li>
                <li>口唇；アトピー性皮膚炎患者の口唇は血色が薄く、境界が不鮮明になっている。<br>リップペンシルで輪郭をとり、口紅やグロスを塗ると唇の縦ジワが改善する。
                </li>
                <li>応用テクニック；眉尻下にホワイトのパウダーを乗せると、目元に立体感が出る。<br>下まぶたから頬にかけてはパール入りのパウダーをのせると皮膚に立体感とつやがあるように見える。</li>
            </ul>
            <h2 class="h2" style="color:#6D6D6D;">接触性皮膚炎を生じる確立の低い製品を勧める。</h2>
                <ul class="ul2 ul_number">
                    <li>ラウリル硫酸ナトリウムを含有しない製品；歯磨剤の発泡剤のも含有。</li>
                    <li>無香料・無色素のものを選択する。</li>
                    <li>ドライスキンの場合は、弱酸性で、脱脂力の弱い物を選択する。</li>
                </ul>
            <h2 class="h2" style="color:#6D6D6D;">アトピー性皮膚炎の入浴</h2>
                <ul class="ul2" style="padding-left: 50px;">
                    <li>１日１回夜が原則ですが、運動などで汗をかいた場合は、直後にシャワーで落とすことが大切。</li>
                    <li>ドライスキンには、硫黄を含むものは避けた方がいい。</li>
                    <li>入浴後は、保湿薬を用いたスキンケアが大切。</li>
                </ul>
            <h2 class="h2" style="color:#6D6D6D;">アトピー性皮膚炎のシャンプー</h2>
            <ul class="ul2" style="padding-left: 50px;">
                <li>毛穴の周囲の過剰な皮脂や整髪料などはシャンプーでないと落ちない。<br>１日１回夜に行うのが最良である。</li>
            </ul>
            <p class="text mt20">＜方法＞</p>
            <ul class="ul2 ul_number" style="padding-bottom:50px;">
                <li>頭全体を軽くブラッシングする。</li>
                <li>40度前後のぬるま湯で髪と地肌の表面の汚れを流し、軽く水気を切る。</li>
                <li>シャンプー剤を適量手のひらに取り、水を少し混ぜて泡立てる。</li>
                <li>泡立てたシャンプーを髪と地肌につけ、指の腹でマッサージをするように洗う。</li>
                <li>シャワーを当てながら、２～３分しっかりとすすぐ。</li>
                <li>できれば2度洗いする。1度目はサッと汚れを落とす程度。<br>2度目はしっかりとすすぎ洗いをする。</li>
                <li>リンスを髪全体につけて、洗い流す。</li>
            </ul>
        </div>
    </section>
</div>
</main>
<?php echo $_smarty_tpl->getSubTemplate ($_smarty_tpl->tpl_vars['template_footer']->value, $_smarty_tpl->cache_id, $_smarty_tpl->compile_id, 0, null, array(), 0);?>

</div>
</body>
</html>
<?php }} ?>
